Revit 2027 API
ViewSheet.Duplicate Method
Overload List
Name | Description
Duplicate(SheetDuplicateOption) |  Duplicates this sheet to generate a new one.
Duplicate(ViewDuplicateOption) |  Duplicates this view.
Top
See Also
Reference
ViewSheet Class
Autodesk.Revit.DB Namespace